In [4]:
import pandas as pd
import numpy as np

In [5]:
dic={"name":["shyam","Hari","Suman"
    ],
     "roll":[90,76,87]
    }

In [7]:
df=pd.DataFrame(dic)

In [9]:
df

    name  roll
0  shyam    90
1   Hari    76
2  Suman    87

In [20]:
df.describe()

            roll
count   3.000000
mean   84.333333
std     7.371115
min    76.000000
25%    81.500000
50%    87.000000
75%    88.500000
max    90.000000

In [29]:
df

    name  roll
0  shyam    90
1   Hari    76
2  Suman    87

In [34]:
df.head()

    name  roll
0  shyam    90
1   Hari    76
2  Suman    87